money_capital = 20000    # Подушка безопасности
salary = 5000            # Ежемесячная зарплата
spend = 6000             # Траты за первый месяц
increase = 0.05          # Ежемесячный рост цен
months = 0

while True: #пока выполняется условие, что бюджета хватает на траты
    budget = money_capital + salary

    if budget >= spend: # Проверяем, хватает ли бюджета на текущие траты
        months += 1
        money_capital = budget - spend
        spend *= (1 + increase)  # Увеличиваем траты на 5%, не считая первый месяц
    else:
        break  #Цикл становится ложным

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов

print("Количество месяцев, которое можно протянуть без долгов:", months)
